{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "filters": 32, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "batch_input_shape": [null, 64, 64, 1], "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "trainable": true, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 128, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 36, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-07, "amsgrad": false}, "class_name": "Adam"}, "loss_weights": null, "metrics": ["accuracy"]}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [6272, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 36], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [36], "dtype": "float32"}]}]}